# Урок 8. Python: от простого к практике. Продолжение
# Создать (доделать) телефонный справочник с возможностью c с архитектурой и возможностью реализации:
# 0. Показать все контакты
# 1. Открыть файл с контактами
# 2. Записать файл с контактами
# 3. Добавить контакт
# 4. Изменить контакт
# 5. Удалить контакт
# 6. Поиск по контактам
# .
# Справочник можно сделать в двух видах:
# 1. Консольный вариант (ОБЯЗАТЕЛЬНО, начали на сеимнаре ссылка в описании к семинару)
# 2. GUI (НЕОБЯЗАТЕЛЬНО, пример справочника с GUI естьу нас в дискорде)
# .
# по всем вопросам пишем мне в телеграм @STONECF


import Controller

Controller.start()